const recipeData = [
  {
    item: "中杯冰拿鐵",
    濃縮: "40-50",
    冰塊: "75-80",
    牛奶: "200",
    備註: ""
  },
  {
    item: "特大杯冰拿鐵",
    濃縮: "40-50*2",
    冰塊: "95-100",
    牛奶: "350",
    備註: ""
  },
  {
    item: "中杯熱拿鐵",
    濃縮: "40-50",
    冰塊: "",
    牛奶: "210",
    備註: ""
  },
  {
    item: "特大杯熱拿鐵",
    濃縮: "40-50*2",
    冰塊: "",
    牛奶: "380",
    備註: ""
  },
  {
    item: "中杯冰美式",
    濃縮: "40-50",
    冰塊: "一店 美式鋼230、二店 美式鋼200",
    牛奶: "",
    備註: ""
  },
  {
    item: "特大杯冰美式",
    濃縮: "40-50",
    冰塊: "一店 大奶鋼460、二店 大奶鋼400",
    牛奶: "",
    備註: ""
  },
  {
    item: "中杯冰美式*2",
    濃縮: "40-50*2",
    冰塊: "大奶鋼10分滿",
    牛奶: "",
    備註: ""
  },
  {
    item: "中杯冰美式(不蒸氣）",
    濃縮: "40-50",
    冰塊: "100",
    牛奶: "",
    備註: "常溫水100"
  },
  {
    item: "特大杯美式(不蒸氣）",
    濃縮: "40-50*2",
    冰塊: "200",
    牛奶: "",
    備註: "常溫水200"
  },
  {
    item: "中杯溫美式",
    濃縮: "40-50",
    冰塊: "20",
    牛奶: "",
    備註: "常溫水160"
  },
  {
    item: "特大杯溫美式",
    濃縮: "40-50*2",
    冰塊: "40",
    牛奶: "",
    備註: "常溫水320"
  },
  {
    item: "中杯熱卡布",
    濃縮: "40-50",
    冰塊: "",
    牛奶: "170",
    備註: ""
  },
  {
    item: "特大杯熱卡布",
    濃縮: "40-50*2",
    冰塊: "",
    牛奶: "320",
    備註: ""
  },
  {
    item: "通寧Espresso",
    濃縮: "40-50、跳舞的羊20",
    冰塊: "95-100",
    牛奶: "",
    備註: "輕輕倒入一瓶通寧水"
  },
  {
    item: "冰Espresso",
    濃縮: "35",
    冰塊: "60",
    牛奶: "",
    備註: "18g咖啡豆"
  },
  {
    item: "熱Espresso",
    濃縮: "35",
    冰塊: "",
    牛奶: "",
    備註: "18g咖啡豆"
  },
  {
    item: "1+1set",
    濃縮: "25",
    冰塊: "",
    牛奶: "140",
    備註: "濃縮50、平均分配一半25c.c.製作、完成卡布杯8分滿"
  },
  {
    item: "西西里咖啡",
    濃縮: "40-50*2、麥田巧語22",
    冰塊: "80+常溫水150",
    牛奶: "",
    備註: "檸檬汁40+糖水60"
  },
  {
    item: "芭樂梅林",
    濃縮: "40-50果花飄逸",
    冰塊: "40",
    牛奶: "",
    備註: "梅汁11+檸檬汁5+糖5+芭樂汁140"
  },
  {
    item: "中杯冰手沖",
    糖漿: "",
    配料: "",
    冰塊: "100g+-1顆冰",
    "氣泡水/牛奶": "",
    備註: "1:7/20g:140cc"
  },
  {
    item: "特大杯冰手沖",
    糖漿: "",
    配料: "",
    冰塊: "180g+-1顆冰",
    "氣泡水/牛奶": "",
    備註: "1:7/40g:280cc"
  },
  {
    item: "中杯熱手沖",
    糖漿: "",
    配料: "",
    冰塊: "",
    "氣泡水/牛奶": "",
    備註: "1:12.5/20g:250cc"
  },
  {
    item: "特大杯熱手沖",
    糖漿: "",
    配料: "",
    冰塊: "",
    "氣泡水/牛奶": "",
    備註: "1:12.5/40g:500cc"
  },
  {
    item: "中杯耶加香氛氣泡水",
    糖漿: "15",
    配料: "耶加雪菲2支共20g、140cc熱手沖",
    冰塊: "75-80",
    "氣泡水/牛奶": "泰象氣泡水加至滿杯",
    備註: ""
  },
  {
    item: "特大杯耶加香氛氣泡水",
    糖漿: "30",
    配料: "耶加雪菲2支共40g、280cc熱手沖",
    冰塊: "95-100",
    "氣泡水/牛奶": "泰象氣泡水加至滿杯",
    備註: ""
  },
  {
    item: "梅好同檬",
    糖漿: "",
    配料: "梅汁30g＋檸檬3g+耶加20g+80cc熱手沖",
    冰塊: "100",
    "氣泡水/牛奶": "泰象氣泡水40",
    備註: "器具明濾杯"
  },
  {
    item: "中杯冰紅茶/綠茶",
    糖漿: "",
    茶葉: "4.5",
    熱水: "200",
    冰塊: "4顆",
    備註: "泡熱水4分鐘後加冰塊打均值機倒入杯中 冰塊加到滿"
  },
  {
    item: "特大杯冰紅茶/綠茶",
    糖漿: "",
    茶葉: "8",
    熱水: "320",
    冰塊: "4顆",
    備註: "泡熱水4分鐘後加冰塊打均值機倒入杯中 冰塊加到滿"
  },
  {
    item: "中杯熱紅茶/綠茶",
    糖漿: "",
    茶葉: "4.5",
    熱水: "300",
    冰塊: "",
    備註: "熱水泡4分鐘"
  },
  {
    item: "特大杯熱紅茶/綠茶",
    糖漿: "",
    茶葉: "9",
    熱水: "600",
    冰塊: "",
    備註: "熱水泡4分鐘"
  },
  {
    item: "中杯冰M南非/果茶",
    糖漿: "10",
    茶葉: "10",
    熱水: "200",
    冰塊: "4顆",
    備註: "泡熱水及糖漿6分鐘後加冰塊打均值機倒入杯中 冰塊加到滿"
  },
  {
    item: "特大杯冰M南非/果茶",
    糖漿: "20",
    茶葉: "20",
    熱水: "320",
    冰塊: "4顆",
    備註: "泡熱水及糖漿6分鐘後加冰塊打均值機倒入杯中 冰塊加到滿"
  }
];